# Sorting

By default used **Quick Sort** algo for sorting

In [16]:
import pandas as pd
import numpy as np
 
#Create a Dictionary of series
d = {'Name':pd.Series(['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa']),
   'Age':pd.Series([26,27,25,24,31,27,25,33,42,32,51,47]),
   'Score':pd.Series([89,87,67,55,47,72,76,79,44,92,99,69])}
 
#Create a DataFrame
df = pd.DataFrame(d)
df

         Name  Age  Score
0       Alisa   26     89
1       Bobby   27     87
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
8       David   42     44
9      Andrew   32     92
10       Ajay   51     99
11     Teresa   47     69

In [20]:
df.sort_values(by=['Age', 'Score'], ascending=[0,0])

         Name  Age  Score
10       Ajay   51     99
11     Teresa   47     69
8       David   42     44
7       Rahul   33     79
9      Andrew   32     92
4       Rocky   31     47
1       Bobby   27     87
5   Sebastian   27     72
0       Alisa   26     89
6    Jaqluine   25     76
2    Cathrine   25     67
3     Madonna   24     55

<hr />

# Joins

In [55]:
A = {
    'Id' : [1,2,3],
    'name': ['ali', 'yasir', 'ahmad']}
B = {
    'Ids': [1,3,4],
    'age': [20,34,25]
}

dfA = pd.DataFrame(A)
dfA.set_index('Id', inplace=True)

dfB = pd.DataFrame(B)
#dfB.set_index('Ids', inplace=True)

In [56]:
dfA

     name
Id
1     ali
2   yasir
3   ahmad

In [57]:
dfB

   Ids  age
0    1   20
1    3   34
2    4   25

**_FULL OUTER JOIN (UNION)_**

In [46]:
dfA.merge(dfB, how='outer', left_on='Id', right_on='Ids', left_index=True, sort=True)

    name  Ids   age
0    ali  1.0  20.0
2  yasir  NaN   NaN
1  ahmad  3.0  34.0
2    NaN  4.0  25.0

**_INNER JOIN (INTERSACTION)_**

In [30]:
dfA.merge(dfB, how='inner', on='Id')

     name  age
Id
1     ali   20
3   ahmad   34

**_LEFT JOIN_**

In [58]:
#dfA.merge(dfB, how='left', on='Id')



# dfA.set_index('Id', inplace=True), dfB.set_index('Ids', inplace=True)
#dfA.merge(dfB, how='left', left_index=True, right_index=True)

# dfA.set_index('Id', inplace=True)
dfA.merge(dfB, how='left', left_index=True, right_on="Ids")

    name  Ids   age
0    ali    1  20.0
2  yasir    2   NaN
1  ahmad    3  34.0

In [32]:
dfA.merge(dfB, how='right', on='Id')

     name  age
Id
1     ali   20
3   ahmad   34
4     NaN   25

**_RIGHT JOIN_**

< hr />

# Merge

# Concatenation